perf/results/timeout/timeout_gunicorn.log

> perf@1.0.0 artillery /Users/mmariotti/Documents/UBA/1c20-tp-1/perf
> artillery "run" "timeout.yaml" "-e" "gunicorn"

Started phase 0 (Ramp), duration: 30s @ 01:39:57(-0300) 2020-05-20
Report @ 01:40:07(-0300) 2020-05-20
Elapsed time: 10 seconds
  Scenarios launched:  67
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 6.93
  Response time (msec):
    min: 5013.5
    max: 5013.5
    median: 5013.5
    p95: 5013.5
    p99: 5013.5
  Codes:
    200: 1

Report @ 01:40:17(-0300) 2020-05-20
Elapsed time: 20 seconds
  Scenarios launched:  118
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 11.86
  Response time (msec):
    min: 9699.8
    max: 14551.1
    median: 12125.5
    p95: 14551.1
    p99: 14551.1
  Codes:
    200: 2

Report @ 01:40:27(-0300) 2020-05-20
Elapsed time: 30 seconds
  Scenarios launched:  179
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 17.9
  Response time (msec):
    min: 19453.6
    max: 24257.5
    median: 21855.5
    p95: 24257.5
    p99: 24257.5
  Codes:
    200: 2

Started phase 1 (Plain), duration: 120s @ 01:40:27(-0300) 2020-05-20
Report @ 01:40:37(-0300) 2020-05-20
Elapsed time: 40 seconds
  Scenarios launched:  199
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 19.9
  Response time (msec):
    min: 29157.7
    max: 34106.7
    median: 31632.2
    p95: 34106.7
    p99: 34106.7
  Codes:
    200: 2
  Errors:
    ECONNRESET: 45

Report @ 01:40:47(-0300) 2020-05-20
Elapsed time: 50 seconds
  Scenarios launched:  200
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 20
  Response time (msec):
    min: 38802.3
    max: 43702.5
    median: 41252.4
    p95: 43702.5
    p99: 43702.5
  Codes:
    200: 2
  Errors:
    ECONNRESET: 198

Report @ 01:40:57(-0300) 2020-05-20
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 20
  Response time (msec):
    min: 48451.6
    max: 53302.2
    median: 50876.9
    p95: 53302.2
    p99: 53302.2
  Codes:
    200: 2
  Errors:
    ECONNRESET: 198

Report @ 01:41:07(-0300) 2020-05-20
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 57
  Requests completed:  57
  Mean response/sec: 20
  Response time (msec):
    min: 57952.9
    max: 59938.6
    median: 59935.8
    p95: 59937.9
    p99: 59938.5
  Codes:
    200: 1
    504: 56
  Errors:
    ECONNRESET: 144

Report @ 01:41:17(-0300) 2020-05-20
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 118
  Requests completed:  118
  Mean response/sec: 20
  Response time (msec):
    min: 59933.6
    max: 59940.2
    median: 59935.7
    p95: 59938.6
    p99: 59939.6
  Codes:
    504: 118
  Errors:
    ECONNRESET: 82

Report @ 01:41:27(-0300) 2020-05-20
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 175
  Requests completed:  175
  Mean response/sec: 20
  Response time (msec):
    min: 59934
    max: 67035.8
    median: 59935.7
    p95: 59938.6
    p99: 63023.4
  Codes:
    504: 175
  Errors:
    ECONNRESET: 25

Report @ 01:41:37(-0300) 2020-05-20
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  200
  Scenarios completed: 157
  Requests completed:  157
  Mean response/sec: 20
  Response time (msec):
    min: 59933.3
    max: 67073.5
    median: 59935.2
    p95: 59938
    p99: 67053.5
  Codes:
    504: 157
  Errors:
    ECONNRESET: 42

Report @ 01:41:47(-0300) 2020-05-20
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  200
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 20.02
  Response time (msec):
    min: 59934.4
    max: 59937
    median: 59935.7
    p95: 59937
    p99: 59937
  Codes:
    504: 2
  Errors:
    ECONNRESET: 198

Report @ 01:41:57(-0300) 2020-05-20
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 20
  Response time (msec):
    min: 59936
    max: 59936.8
    median: 59936.4
    p95: 59936.8
    p99: 59936.8
  Codes:
    504: 2
  Errors:
    ECONNRESET: 198

Report @ 01:42:07(-0300) 2020-05-20
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  200
  Scenarios completed: 55
  Requests completed:  55
  Mean response/sec: 20
  Response time (msec):
    min: 59932.5
    max: 59937.7
    median: 59934.7
    p95: 59936.7
    p99: 59937.7
  Codes:
    504: 55
  Errors:
    ECONNRESET: 146

Report @ 01:42:17(-0300) 2020-05-20
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  200
  Scenarios completed: 114
  Requests completed:  114
  Mean response/sec: 20
  Response time (msec):
    min: 59932.7
    max: 62985
    median: 59934.5
    p95: 59938
    p99: 61705.4
  Codes:
    504: 114
  Errors:
    ECONNRESET: 86

Report @ 01:42:27(-0300) 2020-05-20
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  200
  Scenarios completed: 168
  Requests completed:  168
  Mean response/sec: 20
  Response time (msec):
    min: 59932.6
    max: 59938.3
    median: 59934.1
    p95: 59936.7
    p99: 59937.4
  Codes:
    504: 168
  Errors:
    ECONNRESET: 32

Report @ 01:42:37(-0300) 2020-05-20
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  9
  Scenarios completed: 144
  Requests completed:  144
  Mean response/sec: 0.9
  Response time (msec):
    min: 59933.4
    max: 75432.1
    median: 59935.6
    p95: 59940.7
    p99: 75386
  Codes:
    504: 144
  Errors:
    ECONNRESET: 2

Report @ 01:42:47(-0300) 2020-05-20
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: NaN
  Response time (msec):
    min: 59939.8
    max: 91827.4
    median: 75102.8
    p95: 91827.4
    p99: 91827.4
  Codes:
    504: 10

Report @ 01:42:57(-0300) 2020-05-20
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 13
  Requests completed:  13
  Mean response/sec: NaN
  Response time (msec):
    min: 59941.8
    max: 91893.7
    median: 75289.6
    p95: 91893.3
    p99: 91893.7
  Codes:
    504: 13

Report @ 01:43:07(-0300) 2020-05-20
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 59
  Requests completed:  59
  Mean response/sec: NaN
  Response time (msec):
    min: 59935.4
    max: 91910.2
    median: 59937.6
    p95: 91715.5
    p99: 91905.8
  Codes:
    504: 59

Report @ 01:43:17(-0300) 2020-05-20
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 112
  Requests completed:  112
  Mean response/sec: NaN
  Response time (msec):
    min: 59935
    max: 67037.2
    median: 59937.4
    p95: 59941.1
    p99: 64526
  Codes:
    504: 112

Report @ 01:43:27(-0300) 2020-05-20
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 151
  Requests completed:  151
  Mean response/sec: NaN
  Response time (msec):
    min: 59934.5
    max: 59944.3
    median: 59936.7
    p95: 59939.6
    p99: 59940.6
  Codes:
    504: 151

Report @ 01:43:37(-0300) 2020-05-20
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: NaN
  Response time (msec):
    min: 59937.8
    max: 67045.9
    median: 59939
    p95: 67045.9
    p99: 67045.9
  Codes:
    504: 3

Report @ 01:43:47(-0300) 2020-05-20
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 19
  Requests completed:  19
  Mean response/sec: NaN
  Response time (msec):
    min: 75102.1
    max: 91852.9
    median: 75362.8
    p95: 91808
    p99: 91852.9
  Codes:
    504: 19

Report @ 01:43:57(-0300) 2020-05-20
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: NaN
  Response time (msec):
    min: 91691.8
    max: 91892.3
    median: 91792.1
    p95: 91892.3
    p99: 91892.3
  Codes:
    504: 2

Report @ 01:43:57(-0300) 2020-05-20
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: NaN
  Response time (msec):
    min: 91594
    max: 91892.7
    median: 91768.3
    p95: 91892.7
    p99: 91892.7
  Codes:
    504: 4

All virtual users finished
Summary report @ 01:43:57(-0300) 2020-05-20
  Scenarios launched:  2772
  Scenarios completed: 1376
  Requests completed:  1376
  Mean response/sec: 11.55
  Response time (msec):
    min: 5013.5
    max: 91910.2
    median: 59935.7
    p95: 62384.7
    p99: 91646.4
  Scenario counts:
    timeout: 2772 (100%)
  Codes:
    200: 12
    504: 1364
  Errors:
    ECONNRESET: 1396